app/Models/AmoModel.php

    public function obtenerAmos(){

        return $this->findAll();
---
SELECT *
FROM `amos`