app/Models/MascotaModel.php

SELECT *
FROM `mascotas`
---
     public function obtenerMascotas(){

        return $this->findAll();