app/Models/RelacionAmoMascotaModel.php

    public function obtenerRegistrosAmoDeMascotas($idMascota){
        return $this->where(["idMascota" => $idMascota])->find();
---
SELECT *
FROM `amo_mascotas`
WHERE `idMascota` = '25'

    public function obtenerRegistrosMascotasDeAmo($idAmo){
        return $this->where(["idAmo" => $idAmo])->find();
---
SELECT *
FROM `amo_mascotas`
WHERE `idAmo` = '16'

    public function obtenerAmosPorMascotas($idMascota){

        $builder = $this->db->table('amo_mascotas');
        $builder->select("amos.idAmo, amos.nombre, amos.direccion, amos.telefono, amos.fechaAlta");
        $builder->join("amos", "amos.idAmo = amo_mascotas.idAmo");
        $builder->where("amo_mascotas.idMascota", $idMascota);
        $query = $builder->get();
---
SELECT `amos`.`idAmo`, `amos`.`nombre`, `amos`.`direccion`, `amos`.`telefono`, `amos`.`fechaAlta`
FROM `amo_mascotas`
JOIN `amos` ON `amos`.`idAmo` = `amo_mascotas`.`idAmo`
WHERE `amo_mascotas`.`idMascota` = '25'

    public function obtenerMascotasPorAmos($idAmo){

        $builder = $this->db->table('amo_mascotas');
        $builder->select("mascotas.idMascotas, mascotas.nombre, mascotas.especie, mascotas.raza, mascotas.nroRegistro, mascotas.edad, mascotas.amoActual ,mascotas.fechaAlta");
        $builder->join("mascotas", "mascotas.idMascotas = amo_mascotas.idMascota");
        $builder->where("amo_mascotas.idAmo", $idAmo);
        $query = $builder->get();
---
SELECT `mascotas`.`idMascotas`, `mascotas`.`nombre`, `mascotas`.`especie`, `mascotas`.`raza`, `mascotas`.`nroRegistro`, `mascotas`.`edad`, `mascotas`.`amoActual`, `mascotas`.`fechaAlta`
FROM `amo_mascotas`
JOIN `mascotas` ON `mascotas`.`idMascotas` = `amo_mascotas`.`idMascota`
WHERE `amo_mascotas`.`idAmo` = '16'