app/Models/VeterinarioModel.php

    public function insertarVeterinario($data){

    return $this->insert($data);
---
INSERT INTO `veterinario` (`nombre`, `especialidad`, `telefono`) VALUES ('Pancho', 'Clinico', '2665038790')

    public function obtenerVeterinarios(){

        return $this->findAll();
---
SELECT *
FROM `veterinario`

     public function obtenerVeterinarioPorId($idVeterinario){

        return $this->where("idVeterinario", $idVeterinario)->first();
---
SELECT *
FROM `veterinario`
WHERE `idVeterinario` = '1'
 LIMIT 1

    public function actualizarVeterinario($idVeterinario,$data){

        return $this->update($idVeterinario, $data);
---
UPDATE `veterinario` SET `nombre` = 'Pancho', `especialidad` = 'Clinico', `telefono` = '2665038790'
WHERE `veterinario`.`idVeterinario` IN ('1')